The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId Network_NotEnoughNodes { get; }
  Visual Basic
Public Shared ReadOnly Property Network_NotEnoughNodes As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ Network_NotEnoughNodes {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace